Repository: lelongho89/chinese_chess
Catalog: lib/l10n/app_*.arb
Languages: vi

# appTitle
source: Chinese Chess
vi: Cờ Tướng

source: Open Menu
vi: Mở Menu

source: Flip Board
vi: Lật Bàn Cờ

# copyCode
source: Copy Chess Code
vi: Sao Chép Mã Cờ

# parseCode
source: Parse Chess Code
vi: Phân Tích Mã Cờ

# editCode
source: Edit Chess
vi: Chỉnh Sửa Cờ

source: New Game
vi: Ván Mới

# loadManual
source: Load Chess Manual
vi: Tải Bản Ghi Cờ

# saveManual
source: Save Chess Manual
vi: Lưu Bản Ghi Cờ

source: Setting
vi: Cài Đặt

# featureNotAvailable
source: Feature is not available
vi: Tính năng chưa khả dụng

# modeRobot
source: Robot Mode
vi: Chế Độ Máy

# modeRobotSubtitle
source: Play against AI opponent
vi: Chơi với đối thủ AI

# modeOnline
source: Online Mode
vi: Chế Độ Trực Tuyến

# modeOnlineSubtitle
source: Play with friends online
vi: Chơi với bạn bè trực tuyến

# modeFree
source: Free Mode
vi: Chế Độ Tự Do

# modeFreeSubtitle
source: Local multiplayer on same device
vi: Nhiều người chơi cục bộ trên cùng thiết bị

# chooseGameMode
source: Choose your game mode
vi: Chọn chế độ trò chơi

source: Coming Soon
vi: Sắp Ra Mắt

source: Clear All
vi: Xóa Tất Cả

# save
source: Apply
vi: Áp Dụng

source: Trusteeship to Robots
vi: Giao Cho Máy

# cancelRobots
source: Cancel Trusteeship
vi: Hủy Giao Cho Máy

source: Thinking...
vi: Đang Suy Nghĩ...

# currentInfo
source: Current
vi: Hiện Tại

source: Manual
vi: Hướng Dẫn

# theEvent
source: Event:
vi: Sự Kiện:

# theSite
source: Site:
vi: Địa Điểm:

# theDate
source: Date:
vi: Ngày:

# theRound
source: Round:
vi: Vòng:

# theRed
source: Red:
vi: Đỏ:

# theBlack
source: Black:
vi: Đen:

# stepStart
source: ==Start==
vi: ==Bắt Đầu==

source: Exit Now ?
vi: Thoát Ngay?

# dontExit
source: Wait a moment
vi: Chờ Một Chút

source: Yes exit
vi: Thoát

source: Click again to Exit
vi: Nhấn Lần Nữa Để Thoát

source: Apply
vi: Áp Dụng

# situationCode
source: Chess Code
vi: Mã Cờ

# invalidCode
source: Invalid Chess Code
vi: Mã Cờ Không Hợp Lệ

source: Copy Success
vi: Sao Chép Thành Công

source: Save Success
vi: Lưu Thành Công

# selectDirectorySave
source: Select a Directory to Save
vi: Chọn Thư Mục Để Lưu

# saveFilename
source: Filename to Save
vi: Tên Tệp Để Lưu

source: Select .PGN file
vi: Chọn Tệp .PGN

source: Recommend Move
vi: Nước Đi Đề Xuất

source: Remark
vi: Ghi Chú

source: No remark
vi: Không Có Ghi Chú

source: Check
vi: Chiếu

source: Checkmate
vi: Chiếu Bí

# longRecheckLoose
source: The same move 3 round to Lose
vi: Cùng Nước Đi 3 Vòng Sẽ Thua

# noEatToDraw
source: 60 round with no eat to Draw
vi: 60 Vòng Không Ăn Quân Sẽ Hòa

# trapped
source: Checkmate
vi: Chiếu Bí

# redLoose
source: Loose
vi: Thua

# redWin
source: Win
vi: Thắng

# redDraw
source: Draw
vi: Hòa

# requestDraw
source: Asked for a draw
vi: Đề Nghị Hòa

source: Agree to draw
vi: Đồng Ý Hòa

# requestRetract
source: Asked for a Retract
vi: Đề Nghị Đi Lại

# agreeRetract
source: Agree to retract
vi: Đồng Ý Đi Lại

# disagreeRetract
source: Disagree to retract
vi: Từ Chối Đi Lại

# cantSendCheck
source: You can't send Check
vi: Bạn Không Thể Tự Chiếu

# plsParryCheck
source: Please parry the Check
vi: Hãy Chống Chiếu

# oneMoreGame
source: New Game
vi: Ván Mới

# letMeSee
source: Not now
vi: Để Sau

# settingTitle
source: Settings
vi: Cài Đặt

source: AI Type
vi: Loại AI

source: Built-in Engine
vi: Máy Tích Hợp

source: AI Level
vi: Cấp Độ AI

source: Beginner
vi: Người Mới

source: Intermediate
vi: Trung Cấp

source: Master
vi: Cao Thủ

source: Game Sound
vi: Âm Thanh

source: Sound Volume
vi: Âm Lượng

source: Language
vi: Ngôn Ngữ

# languageEnglish
source: English
vi: Tiếng Anh

# languageChinese
source: Chinese
vi: Tiếng Trung

# languageVietnamese
source: Vietnamese
vi: Tiếng Việt

source: Chess Skin
vi: Giao Diện Quân Cờ

# skinWoods
source: Woods
vi: Gỗ

# skinStones
source: Stones
vi: Đá

source: Quit
vi: Thoát

source: Quit Game
vi: Thoát Trò Chơi

source: Email Verification
vi: Xác Minh Email

source: Verify Your Email
vi: Xác Minh Email Của Bạn

source: Verification email sent
vi: Đã gửi email xác minh

# verificationEmailSentDescription
source: We've sent a verification email to your address. Please check your inbox and click the verification link.
vi: Chúng tôi đã gửi email xác minh đến địa chỉ của bạn. Vui lòng kiểm tra hộp thư đến và nhấp vào liên kết xác minh.

source: Resend Verification Email
vi: Gửi Lại Email Xác Minh

source: Resend in
vi: Gửi lại trong

source: seconds
vi: giây

source: Failed to send verification email
vi: Không thể gửi email xác minh

source: Sign Out
vi: Đăng Xuất

source: Sign out failed
vi: Đăng xuất thất bại

source: Forgot Password
vi: Quên Mật Khẩu

source: Reset Password
vi: Đặt Lại Mật Khẩu

# resetPasswordDescription
source: Enter your email address and we'll send you a link to reset your password.
vi: Nhập địa chỉ email của bạn và chúng tôi sẽ gửi cho bạn một liên kết để đặt lại mật khẩu.

source: Send Reset Link
vi: Gửi Liên Kết Đặt Lại

source: Sending reset link...
vi: Đang gửi liên kết đặt lại...

source: Reset Link Sent
vi: Đã Gửi Liên Kết Đặt Lại

# resetLinkSentDescription
source: Check your email for a link to reset your password. If it doesn't appear within a few minutes, check your spam folder.
vi: Kiểm tra email của bạn để tìm liên kết đặt lại mật khẩu. Nếu nó không xuất hiện trong vài phút, hãy kiểm tra thư mục spam của bạn.

# resetPasswordFailed
source: Failed to send reset link
vi: Không thể gửi liên kết đặt lại

source: Back to Login
vi: Quay Lại Đăng Nhập

# emailRequired
source: Email is required
vi: Email là bắt buộc

# invalidEmail
source: Please enter a valid email address
vi: Vui lòng nhập địa chỉ email hợp lệ

source: User not found
vi: Không tìm thấy người dùng

# tooManyRequests
source: Too many requests. Please try again later.
vi: Quá nhiều yêu cầu. Vui lòng thử lại sau.

source: Login
vi: Đăng Nhập

source: Welcome Back
vi: Chào Mừng Trở Lại

source: Password
vi: Mật Khẩu

# passwordRequired
source: Password is required
vi: Mật khẩu là bắt buộc

source: Remember Me
vi: Ghi Nhớ Tôi

# dontHaveAccount
source: Don't have an account?
vi: Chưa có tài khoản?

source: Register
vi: Đăng Ký

source: Logging in...
vi: Đang đăng nhập...

source: Login failed
vi: Đăng nhập thất bại

# userDisabled
source: This account has been disabled
vi: Tài khoản này đã bị vô hiệu hóa

# invalidCredentials
source: Invalid email or password
vi: Email hoặc mật khẩu không hợp lệ

# emailNotVerified
source: Please verify your email address before logging in. Check your inbox for a verification link.
vi: Vui lòng xác minh địa chỉ email của bạn trước khi đăng nhập. Kiểm tra hộp thư đến của bạn để tìm liên kết xác minh.

source: Verification Required
vi: Yêu Cầu Xác Minh

source: Create Account
vi: Tạo Tài Khoản

source: Display Name
vi: Tên Hiển Thị

# displayNameRequired
source: Display name is required
vi: Tên hiển thị là bắt buộc

source: Confirm Password
vi: Xác Nhận Mật Khẩu

# confirmPasswordRequired
source: Please confirm your password
vi: Vui lòng xác nhận mật khẩu của bạn

# passwordTooShort
source: Password must be at least 6 characters
vi: Mật khẩu phải có ít nhất 6 ký tự

source: Passwords do not match
vi: Mật khẩu không khớp

source: I agree to the
vi: Tôi đồng ý với

source: Terms and Conditions
vi: Điều Khoản và Điều Kiện

# termsAndConditionsText
source: By using this app, you agree to our terms of service and privacy policy.
vi: Bằng cách sử dụng ứng dụng này, bạn đồng ý với điều khoản dịch vụ và chính sách bảo mật của chúng tôi.

# mustAgreeToTerms
source: You must agree to the terms and conditions to register
vi: Bạn phải đồng ý với điều khoản và điều kiện để đăng ký

# alreadyHaveAccount
source: Already have an account?
vi: Đã có tài khoản?

source: Creating account...
vi: Đang tạo tài khoản...

source: Registration failed
vi: Đăng ký thất bại

# emailAlreadyInUse
source: This email is already in use
vi: Email này đã được sử dụng

source: Or continue with
vi: Hoặc tiếp tục với

source: Invalid credential
vi: Thông tin đăng nhập không hợp lệ

# accountExistsWithDifferentCredential
source: An account already exists with a different credential
vi: Đã tồn tại tài khoản với thông tin đăng nhập khác

source: Continue as Guest
vi: Tiếp Tục Với Tư Cách Khách

source: Guest Mode
vi: Chế Độ Khách

source: Play as Guest
vi: Chơi Với Tư Cách Khách

source: Guest User
vi: Người Dùng Khách

source: Anonymous User
vi: Người Dùng Ẩn Danh

source: Update Display Name
vi: Cập Nhật Tên Hiển Thị

source: Profile
vi: Hồ Sơ

source: Edit Profile
vi: Chỉnh Sửa Hồ Sơ

source: Save Profile
vi: Lưu Hồ Sơ

# profileUpdated
source: Profile updated successfully
vi: Hồ sơ đã được cập nhật thành công

# profileUpdateFailed
source: Failed to update profile
vi: Không thể cập nhật hồ sơ

# convertToAccount
source: Create Account
vi: Tạo Tài Khoản

# convertToAccountDescription
source: Create a permanent account to save your progress across devices
vi: Tạo tài khoản vĩnh viễn để lưu tiến trình của bạn trên các thiết bị

source: Currently playing as guest
vi: Hiện đang chơi với tư cách khách

source: Timer Enabled
vi: Đã Bật Bộ Hẹn Giờ

source: Timer Disabled
vi: Đã Tắt Bộ Hẹn Giờ

source: Reset Timer
vi: Đặt Lại Bộ Hẹn Giờ

source: Scan QR Code
vi: Quét Mã QR

# scanQRCodeInstructions
source: Point the camera at a QR code to scan it
vi: Hướng máy ảnh vào mã QR để quét

source: Invalid or expired invitation
vi: Lời mời không hợp lệ hoặc đã hết hạn

# invitationAlreadyUsed
source: This invitation has already been used
vi: Lời mời này đã được sử dụng

# invitationExpired
source: This invitation has expired
vi: Lời mời này đã hết hạn

source: Error processing QR code
vi: Lỗi khi xử lý mã QR

source: Error
vi: Lỗi

source: Account
vi: Tài Khoản

source: Home
vi: Trang Chủ

source: Play
vi: Chơi

source: Settings
vi: Cài Đặt

source: Games Played
vi: Số Ván Đã Chơi

source: Games Won
vi: Số Ván Thắng

source: Games Lost
vi: Số Ván Thua

source: Notifications
vi: Thông Báo

source: Sound
vi: Âm Thanh

source: Sound Effects
vi: Hiệu Ứng Âm Thanh

source: Enable sound effects for moves and games
vi: Bật hiệu ứng âm thanh cho nước đi và trò chơi

source: Adjust the volume of sound effects
vi: Điều chỉnh âm lượng hiệu ứng âm thanh

source: Appearance
vi: Giao Diện

source: Piece Style
vi: Kiểu Quân Cờ

source: Choose the visual style of the chess pieces
vi: Chọn kiểu hiển thị của quân cờ

source: Classic
vi: Cổ Điển

source: Board Style
vi: Kiểu Bàn Cờ

source: Select the appearance of the chessboard
vi: Chọn giao diện của bàn cờ

source: Wood
vi: Gỗ

source: Game Timer
vi: Bộ Hẹn Giờ Trò Chơi

source: Turn Time Limit
vi: Giới Hạn Thời Gian Lượt

source: Set the time limit for each player's move
vi: Đặt giới hạn thời gian cho mỗi nước đi của người chơi

# tenMinutes
source: 10 min
vi: 10 phút

source: Enable Timer
vi: Bật Bộ Hẹn Giờ

source: Enable or disable the game timer
vi: Bật hoặc tắt bộ hẹn giờ trò chơi

source: Single Player
vi: Một Người Chơi

source: Play against the computer
vi: Chơi với máy tính

source: Local Multiplayer
vi: Nhiều Người Chơi Cục Bộ

source: Play with a friend on the same device
vi: Chơi với bạn bè trên cùng thiết bị

source: Game Mode
vi: Chế Độ Trò Chơi

source: Difficulty
vi: Độ Khó

source: Easy
vi: Dễ

source: Medium
vi: Trung Bình

source: Hard
vi: Khó

source: Start Game
vi: Bắt Đầu Trò Chơi

source: Joined {date}
vi: Tham gia {date}

source: Change Password
vi: Đổi Mật Khẩu

source: Log Out
vi: Đăng Xuất

source: Delete Profile
vi: Xóa Hồ Sơ

# deleteProfileSubtitle
source: Delete all stats and start fresh
vi: Xóa tất cả thống kê và bắt đầu lại

# deleteProfileConfirmation
source: Are you sure you want to delete your profile? This will permanently delete all your stats, game history, and progress. You will start fresh with a new profile on your next login.
vi: Bạn có chắc chắn muốn xóa hồ sơ của mình không? Điều này sẽ xóa vĩnh viễn tất cả thống kê, lịch sử trò chơi và tiến trình của bạn. Bạn sẽ bắt đầu lại với hồ sơ mới khi đăng nhập lần sau.

source: Cancel
vi: Hủy

# enablePushNotifications
source: Enable push notifications for game updates
vi: Bật thông báo đẩy cho cập nhật trò chơi

source: Matchmaking
vi: Ghép Cặp

source: Cancel Search
vi: Hủy Tìm Kiếm

source: Find Match
vi: Tìm Trận Đấu

source: Invite Friend
vi: Mời Bạn Bè

source: Scan QR Code to Join Match
vi: Quét Mã QR Để Tham Gia Trận Đấu

source: QR code valid for 24 hours
vi: Mã QR có hiệu lực trong 24 giờ

source: Share QR Code
vi: Chia Sẻ Mã QR

source: Sharing
vi: Đang Chia Sẻ

source: Join my Chinese Chess match!
vi: Tham gia trận Cờ Tướng của tôi!

source: Join Match
vi: Tham Gia Trận Đấu

# joinMatchConfirmation
source: Do you want to join {creatorName}'s match?
vi: Bạn có muốn tham gia trận đấu của {creatorName} không?

source: Match joined successfully
vi: Tham gia trận đấu thành công

source: Success
vi: Thành Công

source: Error generating QR code
vi: Lỗi tạo mã QR

source: Error sharing QR code
vi: Lỗi chia sẻ mã QR

source: Error showing QR scanner
vi: Lỗi hiển thị máy quét QR

source: Error showing QR generator
vi: Lỗi hiển thị trình tạo QR

source: Cannot join your own invitation
vi: Không thể tham gia lời mời của chính bạn

source: Error joining match
vi: Lỗi tham gia trận đấu

source: Game Settings
vi: Cài Đặt Trò Chơi

source: AI Difficulty
vi: Độ Khó AI

source: Set the AI difficulty level
vi: Đặt mức độ khó của AI

source: Online Multiplayer
vi: Nhiều Người Chơi Trực Tuyến

source: Rank
vi: Hạng

source: ELO Rating
vi: Điểm ELO

# rankSoldier
source: Soldier
vi: Lính

# rankApprentice
source: Apprentice
vi: Cố Vấn

# rankScholar
source: Scholar
vi: Tượng

# rankKnight
source: Knight
vi: Mã

# rankChariot
source: Chariot
vi: Xe

# rankCannon
source: Cannon
vi: Pháo

# rankGeneral
source: General
vi: Tướng

# rankSoldierDesc
source: Beginner players learning the game
vi: Người chơi mới bắt đầu học trò chơi

# rankApprenticeDesc
source: Players with basic rule understanding
vi: Người chơi hiểu biết cơ bản về luật chơi

# rankScholarDesc
source: Intermediate players with strategic skills
vi: Người chơi trung cấp có kỹ năng chiến thuật

# rankKnightDesc
source: Skilled players mastering tactics
vi: Người chơi thành thạo các chiến thuật

# rankChariotDesc
source: Advanced players with strong game sense
vi: Người chơi cao cấp có cảm giác trò chơi mạnh

# rankCannonDesc
source: Expert players dominating opponents
vi: Người chơi chuyên gia áp đảo đối thủ

# rankGeneralDesc
source: Elite players, masters of Xiangqi
vi: Người chơi ưu tú, bậc thầy Cờ Tướng
